Repository: Nowkoo/BC_IntegracionVentas
Catalog: Translations/IntegracionVentas.*.xlf
Languages: es_es

# Codeunit 4136056025 - NamedType 623984157
source: The call to the web service failed.
es_es: La llamada al servicio web ha fallado.

# Codeunit 4136056025 - NamedType 2563646394
source: The web service returned an error message:\\Status Code: %1\Description: %2
es_es: El servicio web devolvió un mensaje de error:\\Código de estado: %1\Descripción: %2

# Codeunit 566758270 - NamedType 2957809300
source: Invalid response, expected a JSON object as root object.
es_es: [NAB: SUGGESTION]Respuesta inválida, se esperaba un objeto JSON como elemento raíz.

# Codeunit 566758270 - NamedType 3687054781
source: Vendor No. and Customer No. need to be configured first from page Purchases & Payables Setup.
es_es: [NAB: SUGGESTION]Los campos Nº proveedor y Nº cliente deben configurarse primero desde la página de Conf. compras y pagos.

# Codeunit 566758270 - Method 2338463045 - NamedType 2215071904
source: All the sales lines from this order need to be ready before posting.
es_es: [NAB: SUGGESTION]Todas las líneas de venta de este pedido deben estar preparadas antes de registrar.

# Codeunit 566758270 - Method 2512326661 - NamedType 56865694
source: Could not find a token with key %1
es_es: [NAB: SUGGESTION]No se pudo encontrar un token con la clave %1

# Codeunit 566758270 - Method 1075416076 - NamedType 3343110876
source: Web service URL for sent headers needs to be set up first.
es_es: [NAB: SUGGESTION]Primero se debe configurar la URL del servicio web para los encabezados de los pedidos enviados.

# Codeunit 566758270 - Method 578315619 - NamedType 3343110876
source: Web service URL for sent lines needs to be set up first.
es_es: [NAB: SUGGESTION]Primero se debe configurar la URL del servicio web para las líneas de los pedidos enviados.

# Codeunit 566758270 - Method 1856143843 - NamedType 2374456139
source: Some items in the order do not have Vendor Item No. configured. Sales lines containing these items could not be sent.
es_es: [NAB: SUGGESTION]Algunos productos del pedido no tienen configurado el Nº proveedor. Las líneas que contienen estos productos no se han podido enviar al servicio web.

# Codeunit 566758270 - Method 3497450614 - NamedType 1386396840
source: A default Gen. Prod. Posting Group and Inventory Posting Group need to be selected for newly inserted items in Purchases & Payables Setup page.
es_es: [NAB: SUGGESTION]Se deben seleccionar un Grupo contable de producto general y un Grupo registro inventario predeterminados para los nuevos productos insertados en la página de Conf. compras y pagos.

# Codeunit 566758270 - Method 3654691326 - NamedType 3943302989
source: Vendor %1 has added a line with the next item: %2. There is no registry for this item, do you want to create one? Otherwise the line will be ignored.
es_es: [NAB: SUGGESTION]El proveedor %1 ha añadido una línea con el siguiente producto: %2. No existe un registro para este producto. ¿Desea crear uno? De lo contrario, la línea será ignorada.

# Codeunit 566758270 - Method 3889302826 - NamedType 3569966352
source: Sales Integration Job Queue Entry
es_es: [NAB: REVIEW]Integr

# Codeunit 3372244908 - Method 1879162368 - NamedType 3941846598
source: Items acquired from vendor %1 cannot be purchased together with items acquired from other vendors.
es_es: Los productos adquiridos del proveedor %1 no se pueden comprar junto con productos de otros proveedores.

# PageExtension 3921990236 - Control 332267698 - Property 2879900210
source: Sales Integration
es_es: Integración de ventas

# PageExtension 3921990236 - Control 3979136067 - Property 2879900210
source: Extension
es_es: Extensión

# PageExtension 3921990236 - Control 438134560 - Property 1295455071
source: Turn on a Job Queue Entry to exchange sales information with the vendor periodically
es_es: Active una entrada de cola de proyecto para intercambiar periódicamente información de las ventas con el proveedor.

# PageExtension 3921990236 - Control 438134560 - Property 2879900210
source: Run automatically
es_es: Ejecutar automáticamente

# PageExtension 3921990236 - Control 3969412542 - Property 2879900210
source: New Items Setup
es_es: Configuración de nuevos productos

# PageExtension 3921990236 - Control 1936001480 - Property 2879900210
source: Vendor Setup
es_es: Configuración del proveedor

# PageExtension 3921990236 - Control 2884316743 - Property 2879900210
source: Web Service Setup
es_es: Configuración del servicio web

# PageExtension 3921990236 - Control 2575460289 - Property 1295455071
source: Password used to connect to vendor's web service.
es_es: Contraseña utilizada para conectarse al servicio web del proveedor.

# PageExtension 3921990236 - Control 2575460289 - Property 2879900210
source: Password
es_es: Contraseña

# PageExtension 3921990236 - Control 2994142618 - Property 1295455071
source: Username used to connect to vendor's web service.
es_es: Usuario utilizado para conectarse al servicio web del proveedor.

# PageExtension 3921990236 - Control 2994142618 - Property 2879900210
source: Username
es_es: Usuario

# PageExtension 1673401186 - Action 332267698 - Property 2879900210
source: Sales Integration
es_es: Integración de ventas

# PageExtension 1673401186 - Action 228041575 - Property 1295455071
source: Inform the vendor about the sales lines in this order.
es_es: Informa al proveedor de las líneas de venta de este pedido.

# PageExtension 1673401186 - Action 228041575 - Property 2879900210
source: Inform Vendor
es_es: Informar proveedor

# PageExtension 1673401186 - Action 2825511040 - Property 1295455071
source: Updates the sales line in the order based on changes made by the vendor.
es_es: Actualiza las líneas de venta del pedido en base a los cambios realizados por parte del proveedor.

# PageExtension 1673401186 - Action 2825511040 - Property 2879900210
source: Prepare Lines
es_es: Preparar líneas

# PageExtension 2026081320 - Control 513339096 - Property 1295455071
source: Specifies the status of the line: Pending (waiting to be sent to de web service), Sent: (the line has been informed) and Prepared (changes made by the Vendor have been applied)
es_es: Especifica el estado de la línea: Pendiente (esperando a ser enviada al servicio web), Enviado (la línea ha sido informada) y Preparado (se han aplicado los cambios realizados por el proveedor).

# PageExtension 2026081320 - Control 513339096 - Property 2879900210
source: Status
es_es: Estado

# PageExtension 69955983 - Action 332267698 - Property 2879900210
source: Sales Integration
es_es: Integración de ventas

# PageExtension 69955983 - Action 228041575 - Property 1295455071
source: Inform the vendor about the sales lines in this order
es_es: Informa al proveedor de las líneas de venta de este pedido.

# PageExtension 69955983 - Action 228041575 - Property 2879900210
source: Inform Vendor
es_es: Informar proveedor

# PageExtension 69955983 - Action 2825511040 - Property 1295455071
source: Updates the sales line in the order based on changes made by the vendor.
es_es: Actualiza las líneas de venta del pedido en base a los cambios realizados por parte del proveedor.

# PageExtension 69955983 - Action 2825511040 - Property 2879900210
source: Prepare Lines
es_es: Preparar líneas

# TableExtension 3921990236 - Method 2187865331 - NamedType 1597346414
source: Password could not be retrieved.
es_es: No se pudo recuperar la contraseña.

# TableExtension 3921990236 - Method 16813612 - NamedType 3681458125
source: Username could not be retrieved.
es_es: No se pudo recuperar el usuario.

# TableExtension 3921990236 - Method 843942239 - NamedType 2074574151
source: Password could not be saved.
es_es: No se pudo guardar la contraseña.

# TableExtension 3921990236 - Method 1027419032 - NamedType 3710487416
source: Username could not be saved.
es_es: No se pudo guardar el usuario.

# TableExtension 3921990236 - Field 411531942 - Property 1295455071
source: Specifies the default Base Unit of Measure for newly inserted items.
es_es: Especifica la Unidad medida base por defecto para los nuevos productos insertados.

# TableExtension 3921990236 - Field 411531942 - Property 2879900210
source: Base Unit of Measure
es_es: Unidad medida base

# TableExtension 3921990236 - Field 4190130733 - Property 1295455071
source: The identification number that the vendor uses in their system to identify you as a customer.
es_es: El número de identificación que el proveedor utiliza en su sistema para identificarle como cliente.

# TableExtension 3921990236 - Field 4190130733 - Property 2879900210
source: Customer No.
es_es: Nº Cliente

# TableExtension 3921990236 - Field 2139693550 - Property 1295455071
source: Specifies the default Gen. Prod. Posting Group. for newly inserted items.
es_es: Especifica un Grupo contable de producto general por defecto para nuevos productos insertados.

# TableExtension 3921990236 - Field 2139693550 - Property 2879900210
source: Gen. Prod. Posting Group
es_es: Grupo contable de producto general

# TableExtension 3921990236 - Field 995016483 - Property 1295455071
source: URL of the vendor's web service that stores the sales headers data.
es_es: URL del servicio web del proveedor que almacena la información de los encabezados de los pedidos enviados.

# TableExtension 3921990236 - Field 995016483 - Property 2879900210
source: Sent Headers URL
es_es: URL encabezados

# TableExtension 3921990236 - Field 2037375551 - Property 1295455071
source: Specifies the default Inventory Posting Group for newly inserted items.
es_es: Especifica un Grupo registro inventario por defecto para nuevos productos insertados.

# TableExtension 3921990236 - Field 2037375551 - Property 2879900210
source: Inventory Posting Group
es_es: Grupo registro inventario

# TableExtension 3921990236 - Field 2915242865 - Property 2879900210
source: Job Queue Entry Id
es_es: Id entrada cola de proyecto

# TableExtension 3921990236 - Field 1768927268 - Property 1295455071
source: URL of the vendor's web service that stores the sales lines data.
es_es: URL del servicio web del proveedor que almacena la información de las líneas de los pedidos enviados.

# TableExtension 3921990236 - Field 1768927268 - Property 2879900210
source: Sent Lines URL
es_es: URL líneas

# TableExtension 3921990236 - Field 3119688693 - Property 1295455071
source: The name of the vendor selected above.
es_es: El nombre del proveedor seleccionado.

# TableExtension 3921990236 - Field 3119688693 - Property 2879900210
source: Vendor Name
es_es: Nombre proveedor

# TableExtension 3921990236 - Field 1527594213 - Property 1295455071
source: Your identification number for the vendor that hosts the web service.
es_es: Su número de identificación para el proveedor que aloja el servicio web.

# TableExtension 3921990236 - Field 1527594213 - Property 2879900210
source: Vendor No.
es_es: Nº proveedor

source: If you change vendor all the data from the current vendor will be deleted from the web service. Are you sure you want to change vendor?
es_es: Si cambia de proveedor, todos los datos del proveedor actual serán eliminados del servicio web. ¿Está seguro de que desea cambiar de proveedor?

# TableExtension 3921990236 - Field 3625175461 - Property 2879900210
source: WS Password
es_es: [NAB: REVIEW]Contraseña

# TableExtension 3921990236 - Field 1410612670 - Property 2879900210
source: WS Username
es_es: [NAB: REVIEW]Usuario

# TableExtension 1192395785 - Field 356338168 - Property 2879900210
source: Deleting
es_es: Eliminando

# TableExtension 1192395785 - Field 1774844722 - Property 2879900210
source: Is From Exclusive Vendor
es_es: Es del proveedor exclusivo

# TableExtension 2574427010 - Field 513339096 - Property 2879900210
source: Status
es_es: Estado

# Enum 513339096 - EnumValue 3481143665 - Property 2879900210
source: Pending
es_es: Pendiente

# Enum 513339096 - EnumValue 2521603205 - Property 2879900210
source: Ready
es_es: Preparado

# Enum 513339096 - EnumValue 2561328176 - Property 2879900210
source: Sent
es_es: Enviado
